Revit 2027 API
Hardwood.HardwoodImperfectionsAmount Property
 The property labeled "Amount" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string HardwoodImperfectionsAmount { get; }
Public Shared ReadOnly Property HardwoodImperfectionsAmount As String
	Get
public:
static property String^ HardwoodImperfectionsAmount {
	String^ get ();
}
static member HardwoodImperfectionsAmount : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "-10, 10".
See Also
Reference
Hardwood Class
Autodesk.Revit.DB.Visual Namespace